lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/matter_onnetwork_onoff_light.cpp
#if defined(NRF54L15_CLEAN_MATTER_CORE_ENABLE) && NRF54L15_CLEAN_MATTER_CORE_ENABLE
#include "matter_onnetwork_onoff_light.h"

#include <stdio.h>
#include <string.h>

#if defined(NRF54L15_CLEAN_MATTER_CORE_ENABLE) && \
    (NRF54L15_CLEAN_MATTER_CORE_ENABLE != 0)
#include <lib/support/BytesToHex.h>
#endif

#include "nrf54l15_hal_ficr.h"

namespace xiao_nrf54l15 {
namespace {

bool commissioningFlowValid(MatterCommissioningFlow flow) {
  switch (flow) {
    case MatterCommissioningFlow::kStandard:
    case MatterCommissioningFlow::kUserActionRequired:
    case MatterCommissioningFlow::kCustom:
      return true;
    default:
      return false;
  }
}

void setFixedText(char* destination, size_t length, const char* source) {
  if (destination == nullptr || length == 0U) {
    return;
  }
  destination[0] = '\0';
  if (source == nullptr) {
    return;
  }
  strncpy(destination, source, length - 1U);
  destination[length - 1U] = '\0';
}

bool factoryDeviceIdUsable(uint64_t deviceId) {
  return deviceId != 0ULL && deviceId != 0xFFFFFFFFFFFFFFFFULL;
}

uint32_t foldDeviceId32(uint64_t deviceId) {
  uint32_t folded = static_cast<uint32_t>(deviceId) ^
                    static_cast<uint32_t>(deviceId >> 32U);
  folded ^= (folded >> 16U);
  folded *= 0x7FEB352DU;
  folded ^= (folded >> 15U);
  folded *= 0x846CA68BU;
  folded ^= (folded >> 16U);
  return folded;
}

uint16_t discriminatorFromDeviceId(uint64_t deviceId) {
  uint16_t discriminator =
      static_cast<uint16_t>(foldDeviceId32(deviceId) & 0x0FFFU);
  if (discriminator == 0U || discriminator == kDefaultDiscriminator) {
    discriminator =
        static_cast<uint16_t>((discriminator + 0x0357U) & 0x0FFFU);
  }
  return discriminator == 0U ? 1U : discriminator;
}

bool identityIsMatterSpecDefault(const MatterOnNetworkIdentity& identity) {
  return identity.setupPinCode == kDefaultSetupPinCode &&
         identity.discriminator == kDefaultDiscriminator &&
         identity.vendorId == kDefaultVendorId &&
         identity.productId == kDefaultProductId &&
         identity.commissioningFlow == MatterCommissioningFlow::kStandard;
}

void buildDefaultSerialNumber(uint8_t outSerialNumber[32]) {
  if (outSerialNumber == nullptr) {
    return;
  }

  memset(outSerialNumber, 0, 32U);
  const uint64_t deviceId = Ficr::deviceId();
  if (!factoryDeviceIdUsable(deviceId)) {
    memcpy(outSerialNumber, "NRF54-ARC", 9U);
    return;
  }

  char text[32] = {0};
  snprintf(text, sizeof(text), "NRF54-%08lX%08lX",
           static_cast<unsigned long>(deviceId >> 32U),
           static_cast<unsigned long>(deviceId & 0xFFFFFFFFUL));
  memcpy(outSerialNumber, text, strlen(text));
}

}  // namespace

uint16_t Nrf54MatterOnNetworkOnOffLightNode::remainingWindowSeconds(
    uint32_t endMs) {
  if (endMs == 0U) {
    return 0U;
  }

  const int32_t deltaMs = static_cast<int32_t>(endMs - millis());
  if (deltaMs <= 0) {
    return 0U;
  }

  const uint32_t unsignedDeltaMs = static_cast<uint32_t>(deltaMs);
  return static_cast<uint16_t>((unsignedDeltaMs + 999U) / 1000U);
}

bool Nrf54MatterOnNetworkOnOffLightNode::bytesToUpperHex(
    const uint8_t* data, size_t length, char* outBuffer, size_t outBufferSize,
    size_t* outHexLength) {
  static constexpr char kHexDigits[] = "0123456789ABCDEF";

  if (outHexLength != nullptr) {
    *outHexLength = 0U;
  }
  if (data == nullptr || outBuffer == nullptr ||
      outBufferSize < ((length * 2U) + 1U)) {
    return false;
  }

  for (size_t i = 0; i < length; ++i) {
    outBuffer[i * 2U] = kHexDigits[(data[i] >> 4U) & 0x0FU];
    outBuffer[(i * 2U) + 1U] = kHexDigits[data[i] & 0x0FU];
  }
  outBuffer[length * 2U] = '\0';
  if (outHexLength != nullptr) {
    *outHexLength = length * 2U;
  }
  return true;
}

int Nrf54MatterOnNetworkOnOffLightNode::hexNibble(char value) {
  if (value >= '0' && value <= '9') {
    return value - '0';
  }
  if (value >= 'A' && value <= 'F') {
    return 10 + (value - 'A');
  }
  if (value >= 'a' && value <= 'f') {
    return 10 + (value - 'a');
  }
  return -1;
}

bool Nrf54MatterOnNetworkOnOffLightNode::hexToBytes(
    const char* text, uint8_t* outData, size_t outCapacity,
    size_t* outLength) {
  if (outLength != nullptr) {
    *outLength = 0U;
  }
  if (text == nullptr || outData == nullptr) {
    return false;
  }

  int highNibble = -1;
  size_t length = 0U;
  for (const char* current = text; *current != '\0'; ++current) {
    const char c = *current;
    if (c == ' ' || c == '\t' || c == '\r' || c == '\n' || c == ':' ||
        c == '-') {
      continue;
    }

    const int nibble = hexNibble(c);
    if (nibble < 0) {
      return false;
    }

    if (highNibble < 0) {
      highNibble = nibble;
      continue;
    }

    if (length >= outCapacity) {
      return false;
    }

    outData[length++] =
        static_cast<uint8_t>((highNibble << 4U) | static_cast<uint8_t>(nibble));
    highNibble = -1;
  }

  if (highNibble >= 0 || length == 0U) {
    return false;
  }

  if (outLength != nullptr) {
    *outLength = length;
  }
  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::addDiscoveryText(
    MatterOnNetworkDiscoveryRecord* record,
    const char* text) {
  if (record == nullptr || text == nullptr ||
      record->textEntryCount >= MatterOnNetworkDiscoveryRecord::kMaxTextEntries) {
    return false;
  }

  setFixedText(record->textEntries[record->textEntryCount].value,
               sizeof(record->textEntries[record->textEntryCount].value),
               text);
  ++record->textEntryCount;
  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::addDiscoverySubtype(
    MatterOnNetworkDiscoveryRecord* record,
    const char* subtype) {
  if (record == nullptr || subtype == nullptr ||
      record->subtypeCount >= MatterOnNetworkDiscoveryRecord::kMaxSubtypes) {
    return false;
  }

  setFixedText(record->subtypes[record->subtypeCount].value,
               sizeof(record->subtypes[record->subtypeCount].value),
               subtype);
  ++record->subtypeCount;
  return true;
}

void Nrf54MatterOnNetworkOnOffLightNode::buildDiscoveryHostName(
    const MatterOnNetworkIdentity& identity,
    char* outHostName,
    size_t outHostNameSize) {
  if (outHostName == nullptr || outHostNameSize == 0U) {
    return;
  }

