lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/matter_onnetwork_onoff_light.cpp
  snprintf(outHostName, outHostNameSize, "nrf54l15-%04x",
           static_cast<unsigned>(identity.discriminator & 0x0FFFU));
  outHostName[outHostNameSize - 1U] = '\0';
}

bool Nrf54MatterOnNetworkOnOffLightNode::begin(
    const MatterOnNetworkOnOffLightConfig* config) {
  if (storageOpen_) {
    setFixedText(beginFailureName_, sizeof(beginFailureName_),
                 "already_started");
    return false;
  }
  setFixedText(beginFailureName_, sizeof(beginFailureName_),
               "begin_in_progress");

  const MatterOnNetworkOnOffLightConfig defaultConfig = {};
  const MatterOnNetworkOnOffLightConfig& effectiveConfig =
      config != nullptr ? *config : defaultConfig;
  const char* storageNamespace =
      (effectiveConfig.storageNamespace != nullptr &&
       effectiveConfig.storageNamespace[0] != '\0')
          ? effectiveConfig.storageNamespace
          : "matter_node";
  if (!prefs_.begin(storageNamespace, false)) {
    setFixedText(beginFailureName_, sizeof(beginFailureName_),
                 "prefs_begin_failed");
    resetDiscoveryPublication(beginFailureName_);
    return false;
  }

  storageOpen_ = true;
  datasetSource_ = MatterOnNetworkDatasetSource::kNone;
  resetDiscoveryPublication("not_started");
  autoRequestRouterRole_ = effectiveConfig.autoRequestRouterRole;
  routerRoleRequested_ = false;
  commissioningWindowPending_ = false;
  commissioningWindowExpired_ = false;
  commissioningWindowDurationSeconds_ = 0U;
  commissioningWindowEndMs_ = 0U;
  endpoint_.attach(&light_);
  endpoint_.setAccessControl(&accessControl_);
  buildDefaultIdentity(&identity_);
  const MatterOnNetworkIdentity hardwareDefaultIdentity = identity_;

  accessControl_.clear();
  accessControlReady_ = accessControl_.addDefaultViewEntry();

  if (identityValid(effectiveConfig.identity) &&
      (!effectiveConfig.deriveDefaultIdentityFromHardware ||
       !identityIsMatterSpecDefault(effectiveConfig.identity))) {
    identity_ = effectiveConfig.identity;
  }
  if (effectiveConfig.restorePersistentState) {
    MatterOnNetworkIdentity restoredIdentity = {};
    if (loadPersistentIdentity(&restoredIdentity)) {
      if (!effectiveConfig.deriveDefaultIdentityFromHardware ||
          !identityIsMatterSpecDefault(restoredIdentity)) {
        identity_ = restoredIdentity;
      } else {
        identity_ = hardwareDefaultIdentity;
      }
    }
  }

  // The test DAC must describe the final configured or restored identity.
  uint8_t serialNumber[32] = {0};
  buildDefaultSerialNumber(serialNumber);
  attestationReady_ = attestation_.generateTestChain(
      identity_.vendorId, identity_.productId, serialNumber);
  if (!attestationReady_) {
    end();
    setFixedText(beginFailureName_, sizeof(beginFailureName_),
                 "test_attestation_init_failed");
    resetDiscoveryPublication(beginFailureName_);
    return false;
  }

  if (!savePersistentIdentity()) {
    end();
    setFixedText(beginFailureName_, sizeof(beginFailureName_),
                 "identity_persist_failed");
    resetDiscoveryPublication(beginFailureName_);
    return false;
  }

  const char* lightStorageNamespace =
      (effectiveConfig.lightStorageNamespace != nullptr &&
       effectiveConfig.lightStorageNamespace[0] != '\0')
          ? effectiveConfig.lightStorageNamespace
          : "matter_onoff";
  lightReady_ =
      light_.begin(lightStorageNamespace, effectiveConfig.restorePersistentState);
  if (!lightReady_) {
    end();
    setFixedText(beginFailureName_, sizeof(beginFailureName_),
                 "light_begin_failed");
    resetDiscoveryPublication(beginFailureName_);
    return false;
  }

  otOperationalDatasetTlvs persistentDatasetTlvs = {};
  const bool havePersistentThreadDataset =
      effectiveConfig.restorePersistentState &&
      loadPersistentThreadDataset(&persistentDatasetTlvs);

  if (effectiveConfig.explicitThreadDataset != nullptr) {
    if (!useThreadDataset(*effectiveConfig.explicitThreadDataset)) {
      end();
      setFixedText(beginFailureName_, sizeof(beginFailureName_),
                   "explicit_dataset_failed");
      resetDiscoveryPublication(beginFailureName_);
      return false;
    }
  } else if (havePersistentThreadDataset) {
    if (!useThreadDatasetTlvs(persistentDatasetTlvs, false)) {
      end();
      setFixedText(beginFailureName_, sizeof(beginFailureName_),
                   "persistent_dataset_failed");
      resetDiscoveryPublication(beginFailureName_);
      return false;
    }
    datasetSource_ = MatterOnNetworkDatasetSource::kPersistent;
  } else if (effectiveConfig.threadPassPhrase != nullptr ||
             effectiveConfig.threadNetworkName != nullptr ||
             effectiveConfig.threadExtPanId != nullptr) {
    if (effectiveConfig.threadPassPhrase == nullptr ||
        effectiveConfig.threadNetworkName == nullptr ||
        effectiveConfig.threadExtPanId == nullptr ||
        !useThreadDatasetFromPassphrase(effectiveConfig.threadPassPhrase,
                                        effectiveConfig.threadNetworkName,
                                        effectiveConfig.threadExtPanId)) {
      end();
      setFixedText(beginFailureName_, sizeof(beginFailureName_),
                   "passphrase_dataset_failed");
      resetDiscoveryPublication(beginFailureName_);
      return false;
    }
  } else if (effectiveConfig.useDemoDataset && !useDemoThreadDataset()) {
    end();
    setFixedText(beginFailureName_, sizeof(beginFailureName_),
                 "demo_dataset_failed");
    resetDiscoveryPublication(beginFailureName_);
    return false;
  }

  if (effectiveConfig.autoStartThread &&
      !thread_.begin(effectiveConfig.wipeThreadSettings)) {
    end();
    setFixedText(beginFailureName_, sizeof(beginFailureName_),
                 "thread_begin_failed");
    resetDiscoveryPublication(beginFailureName_);
    return false;
  }

  if (effectiveConfig.autoOpenCommissioningWindow &&
      !openCommissioningWindow(effectiveConfig.commissioningWindowSeconds)) {
    end();
    setFixedText(beginFailureName_, sizeof(beginFailureName_),
                 "commissioning_window_open_failed");
    resetDiscoveryPublication(beginFailureName_);
    return false;
  }

  setFixedText(beginFailureName_, sizeof(beginFailureName_), "none");
  return true;
}

void Nrf54MatterOnNetworkOnOffLightNode::end() {
  clearSrpDiscoveryPublication();
  if (lightReady_) {
    light_.end();
    lightReady_ = false;
  }
  if (storageOpen_) {
    prefs_.end();
    storageOpen_ = false;
  }
  autoRequestRouterRole_ = false;
  routerRoleRequested_ = false;
  commissioningWindowPending_ = false;
  commissioningWindowExpired_ = false;
  commissioningWindowDurationSeconds_ = 0U;
  commissioningWindowEndMs_ = 0U;
  datasetSource_ = MatterOnNetworkDatasetSource::kNone;
  resetDiscoveryPublication("node_stopped");
  endpoint_.detach();
  accessControl_.clear();
  accessControlReady_ = false;
  attestation_ = MatterDeviceAttestation{};
  attestationReady_ = false;
}

void Nrf54MatterOnNetworkOnOffLightNode::process() {
  thread_.process();
  light_.process();

  if (datasetSource_ == MatterOnNetworkDatasetSource::kNone &&
      thread_.restoredFromSettings()) {
    datasetSource_ = MatterOnNetworkDatasetSource::kPersistent;
  }

  if (autoRequestRouterRole_ && !routerRoleRequested_ && thread_.attached()) {
    const Nrf54ThreadExperimental::Role currentRole = thread_.role();
    if (currentRole == Nrf54ThreadExperimental::Role::kRouter ||
        currentRole == Nrf54ThreadExperimental::Role::kLeader) {
      routerRoleRequested_ = true;
    } else if (currentRole == Nrf54ThreadExperimental::Role::kChild &&
               thread_.requestRouterRole()) {
      routerRoleRequested_ = true;
    }
  }

