lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/matter_onnetwork_onoff_light.cpp
  if (commissioningWindowEndMs_ != 0U &&
      remainingWindowSeconds(commissioningWindowEndMs_) == 0U) {
    commissioningWindowEndMs_ = 0U;
    commissioningWindowPending_ = false;
    commissioningWindowExpired_ = true;
  } else if (commissioningWindowPending_ && commissioningWindowDurationSeconds_ != 0U &&
             readyForOnNetworkCommissioning()) {
    commissioningWindowPending_ = false;
    commissioningWindowExpired_ = false;
    commissioningWindowEndMs_ =
        millis() + (static_cast<uint32_t>(commissioningWindowDurationSeconds_) *
                    1000UL);
  }

  (void)updateDiscoveryPublication();
}

bool Nrf54MatterOnNetworkOnOffLightNode::snapshot(
    MatterOnNetworkOnOffLightStatus* outStatus) const {
  if (outStatus == nullptr) {
    return false;
  }

  *outStatus = MatterOnNetworkOnOffLightStatus{};
  outStatus->storageOpen = storageOpen_;
  outStatus->lightReady = lightReady_;
  outStatus->attestationReady = attestationReady_ && attestation_.available();
  outStatus->threadStarted = thread_.started();
  outStatus->threadAttached = thread_.attached();
  outStatus->threadDatasetConfigured = thread_.datasetConfigured();
  outStatus->threadDatasetExportable = threadDatasetExportable();
  outStatus->threadLastChangedFlags = thread_.lastChangedFlags();
  (void)thread_.getAttachDiagnostics(&outStatus->threadAttachDiagnostics);
  (void)thread_.getAttachDebugState(&outStatus->threadAttachDebugState);
  (void)thread_.getAttachSummary(&outStatus->threadAttachSummary);
  (void)thread_.getDatasetRestoreDiagnostics(
      &outStatus->threadRestoreDiagnostics);
  (void)readinessSummary(&outStatus->readinessSummary);
  (void)discoverySummary(&outStatus->discoverySummary);
  (void)discoveryPublicationState(&outStatus->discoveryPublication);
  outStatus->buildSeamsAligned = foundation_.buildSeamsAligned();
  outStatus->datasetSource = datasetSource_;
  outStatus->threadRole = thread_.role();
  outStatus->rloc16 = thread_.rloc16();
  outStatus->identity = identity_;
  outStatus->manualCodeReady = outStatus->readinessSummary.manualCodeReady;
  outStatus->qrCodeReady = outStatus->readinessSummary.qrCodeReady;
  outStatus->readyForOnNetworkCommissioning =
      outStatus->readinessSummary.ready;
  outStatus->commissioningWindowPending = commissioningWindowPending_;
  setFixedText(outStatus->beginFailureName, sizeof(outStatus->beginFailureName),
               beginFailureName_);
  outStatus->commissioningWindowState = commissioningWindowState();
  outStatus->commissioningWindowSecondsRemaining =
      commissioningWindowSecondsRemaining();
  (void)light_.snapshot(&outStatus->light);
  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::setIdentity(
    const MatterOnNetworkIdentity& identity, bool persist) {
  if (!identityValid(identity)) {
    return false;
  }

  MatterDeviceAttestation replacementAttestation;
  uint8_t serialNumber[32] = {0};
  buildDefaultSerialNumber(serialNumber);
  if (!replacementAttestation.generateTestChain(
          identity.vendorId, identity.productId, serialNumber)) {
    return false;
  }

  const bool discoveryPublished =
      discoveryPublicationActive_ || discoverySrpServiceQueued_ ||
      discoverySrpHostRegistered_ || discoverySrpServiceRegistered_ ||
      discoverySrpRemovePending_;
  if (discoveryPublished && !requestSrpDiscoveryUnpublish(true)) {
    return false;
  }

  const MatterOnNetworkIdentity previousIdentity = identity_;
  identity_ = identity;
  if (persist && !savePersistentIdentity()) {
    identity_ = previousIdentity;
    if (storageOpen_) {
      (void)updateDiscoveryPublication();
    }
    return false;
  }

  attestation_ = replacementAttestation;
  attestationReady_ = attestation_.available();
  if (storageOpen_) {
    (void)updateDiscoveryPublication();
  }
  return true;
}

const MatterOnNetworkIdentity& Nrf54MatterOnNetworkOnOffLightNode::identity()
    const {
  return identity_;
}

bool Nrf54MatterOnNetworkOnOffLightNode::restoreDefaultIdentity(bool persist) {
  MatterOnNetworkIdentity defaultIdentity = {};
  buildDefaultIdentity(&defaultIdentity);
  return setIdentity(defaultIdentity, persist);
}

bool Nrf54MatterOnNetworkOnOffLightNode::savePersistentIdentity() {
  if (!storageOpen_) {
    return false;
  }

  MatterOnNetworkPersistentState state = {};
  state.magic = kPersistentStateMagic;
  state.version = kPersistentStateVersion;
  state.setupPinCode = identity_.setupPinCode;
  state.discriminator = identity_.discriminator;
  state.vendorId = identity_.vendorId;
  state.productId = identity_.productId;
  state.commissioningFlow = static_cast<uint8_t>(identity_.commissioningFlow);
  return prefs_.putBytes(kPersistentStateKey, &state, sizeof(state)) ==
         sizeof(state);
}

bool Nrf54MatterOnNetworkOnOffLightNode::clearPersistentIdentity() {
  return storageOpen_ && prefs_.remove(kPersistentStateKey);
}

bool Nrf54MatterOnNetworkOnOffLightNode::useDemoThreadDataset() {
  otOperationalDataset dataset = {};
  Nrf54ThreadExperimental::buildDemoDataset(&dataset);
  return useThreadDataset(dataset, false) &&
         (datasetSource_ = MatterOnNetworkDatasetSource::kDemo,
          true);
}

bool Nrf54MatterOnNetworkOnOffLightNode::useThreadDatasetFromPassphrase(
    const char* passPhrase, const char* networkName,
    const uint8_t extPanId[OT_EXT_PAN_ID_SIZE]) {
  otOperationalDataset dataset = {};
  if (Nrf54ThreadExperimental::buildDatasetFromPassphrase(
          passPhrase, networkName, extPanId, &dataset) != OT_ERROR_NONE ||
      !useThreadDataset(dataset, false)) {
    return false;
  }
  datasetSource_ = MatterOnNetworkDatasetSource::kPassphrase;
  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::useThreadDataset(
    const otOperationalDataset& dataset, bool persist) {
  if (!thread_.setActiveDataset(dataset)) {
    return false;
  }
  datasetSource_ = MatterOnNetworkDatasetSource::kExplicit;
  return !persist || !storageOpen_ || savePersistentThreadDataset();
}

bool Nrf54MatterOnNetworkOnOffLightNode::useThreadDatasetTlvs(
    const otOperationalDatasetTlvs& datasetTlvs, bool persist) {
  if (!otDatasetIsValid(&datasetTlvs, true) ||
      !thread_.setActiveDatasetTlvs(datasetTlvs)) {
    return false;
  }

