lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/matter_onnetwork_onoff_light.cpp
  datasetSource_ = MatterOnNetworkDatasetSource::kExplicit;
  return !persist || !storageOpen_ || savePersistentThreadDataset();
}

bool Nrf54MatterOnNetworkOnOffLightNode::useThreadDatasetHex(
    const char* datasetHex, bool persist) {
  otOperationalDatasetTlvs datasetTlvs = {};
  size_t tlvLength = 0U;
  if (!hexToBytes(datasetHex, datasetTlvs.mTlvs, sizeof(datasetTlvs.mTlvs),
                  &tlvLength)) {
    return false;
  }
  datasetTlvs.mLength = static_cast<uint8_t>(tlvLength);
  return useThreadDatasetTlvs(datasetTlvs, persist);
}

bool Nrf54MatterOnNetworkOnOffLightNode::savePersistentThreadDataset() {
  if (!storageOpen_) {
    return false;
  }

  otOperationalDatasetTlvs datasetTlvs = {};
  if (!exportOpenThreadDatasetTlvs(&datasetTlvs)) {
    return false;
  }

  MatterOnNetworkPersistentThreadDataset state = {};
  state.magic = kPersistentThreadDatasetMagic;
  state.version = kPersistentThreadDatasetVersion;
  state.length = datasetTlvs.mLength;
  memcpy(state.tlvs, datasetTlvs.mTlvs, datasetTlvs.mLength);
  return prefs_.putBytes(kPersistentThreadDatasetKey, &state, sizeof(state)) ==
         sizeof(state);
}

bool Nrf54MatterOnNetworkOnOffLightNode::clearPersistentThreadDataset() {
  return storageOpen_ && prefs_.remove(kPersistentThreadDatasetKey);
}

bool Nrf54MatterOnNetworkOnOffLightNode::factoryReset() {
  if (!storageOpen_ || !lightReady_) {
    return false;
  }

  closeCommissioningWindow();
  light_.stopIdentify();
  if (!light_.setOn(false, false) ||
      !light_.setStartUpBehavior(
          MatterOnOffLightStartUpBehavior::kRestorePrevious, false) ||
      !light_.savePersistentState() || !restoreDefaultIdentity(true)) {
    return false;
  }

  return !prefs_.isKey(kPersistentThreadDatasetKey) ||
         clearPersistentThreadDataset();
}

bool Nrf54MatterOnNetworkOnOffLightNode::openCommissioningWindow(
    uint16_t seconds) {
  if (!storageOpen_ || seconds == 0U) {
    return false;
  }

  commissioningWindowDurationSeconds_ = seconds;
  commissioningWindowExpired_ = false;
  commissioningWindowEndMs_ = 0U;
  commissioningWindowPending_ = !readyForOnNetworkCommissioning();
  if (!commissioningWindowPending_) {
    commissioningWindowEndMs_ =
        millis() + (static_cast<uint32_t>(seconds) * 1000UL);
  }
  return true;
}

void Nrf54MatterOnNetworkOnOffLightNode::closeCommissioningWindow() {
  commissioningWindowPending_ = false;
  commissioningWindowExpired_ = false;
  commissioningWindowDurationSeconds_ = 0U;
  commissioningWindowEndMs_ = 0U;
}

MatterCommissioningWindowState
Nrf54MatterOnNetworkOnOffLightNode::commissioningWindowState() const {
  if (commissioningWindowSecondsRemaining() != 0U) {
    return MatterCommissioningWindowState::kOpen;
  }
  if (commissioningWindowPending_) {
    return MatterCommissioningWindowState::kPendingReadiness;
  }
  if (commissioningWindowExpired_) {
    return MatterCommissioningWindowState::kExpired;
  }
  return MatterCommissioningWindowState::kClosed;
}

bool Nrf54MatterOnNetworkOnOffLightNode::commissioningWindowOpen() const {
  return commissioningWindowState() == MatterCommissioningWindowState::kOpen;
}

uint16_t
Nrf54MatterOnNetworkOnOffLightNode::commissioningWindowSecondsRemaining()
    const {
  return remainingWindowSeconds(commissioningWindowEndMs_);
}

bool Nrf54MatterOnNetworkOnOffLightNode::readinessSummary(
    MatterOnNetworkReadinessSummary* outSummary) const {
  if (outSummary == nullptr) {
    return false;
  }

  *outSummary = MatterOnNetworkReadinessSummary{};
  outSummary->storageOpen = storageOpen_;
  outSummary->lightReady = lightReady_;
  outSummary->foundationReady = foundation_.mechanicalPathPossible();
  outSummary->attestationReady =
      attestationReady_ && attestation_.available();
  outSummary->threadStarted = thread_.started();
  outSummary->threadAttached = thread_.attached();
  outSummary->manualCodeReady = manualPairingCode(nullptr, 0U);
  outSummary->qrCodeReady = qrCode(nullptr, 0U);
  outSummary->threadDatasetExportable = threadDatasetExportable();
  (void)thread_.getAttachSummary(&outSummary->threadAttachSummary);
  (void)thread_.getDatasetRestoreDiagnostics(
      &outSummary->threadRestoreDiagnostics);
  setFixedText(outSummary->beginFailureName,
               sizeof(outSummary->beginFailureName), beginFailureName_);
  outSummary->ready =
      outSummary->storageOpen && outSummary->lightReady &&
      outSummary->foundationReady && outSummary->attestationReady &&
      outSummary->threadStarted &&
      outSummary->threadAttached && outSummary->manualCodeReady &&
      outSummary->qrCodeReady && outSummary->threadDatasetExportable;

  if (!outSummary->storageOpen) {
    setFixedText(outSummary->phaseName, sizeof(outSummary->phaseName),
                 "storage");
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 beginFailureName_[0] != '\0' ? beginFailureName_
                                               : "storage_closed");
  } else if (!outSummary->lightReady) {
    setFixedText(outSummary->phaseName, sizeof(outSummary->phaseName), "light");
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "light_not_ready");
  } else if (!outSummary->foundationReady) {
    setFixedText(outSummary->phaseName, sizeof(outSummary->phaseName),
                 "foundation");
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "mechanical_path_unavailable");
  } else if (!outSummary->attestationReady) {
    setFixedText(outSummary->phaseName, sizeof(outSummary->phaseName),
                 "attestation");
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "test_attestation_not_ready");
  } else if (!outSummary->threadStarted) {
    setFixedText(outSummary->phaseName, sizeof(outSummary->phaseName),
                 "thread");
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "thread_not_started");
  } else if (!outSummary->threadAttached) {
    const char* phase = outSummary->threadAttachSummary.phaseName;
    const char* blocker = outSummary->threadAttachSummary.blockerName;
    setFixedText(outSummary->phaseName, sizeof(outSummary->phaseName),
                 phase[0] != '\0' ? phase : "thread_attach");
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 blocker[0] != '\0' ? blocker : "thread_not_attached");
  } else if (!outSummary->manualCodeReady) {
    setFixedText(outSummary->phaseName, sizeof(outSummary->phaseName),
                 "onboarding");
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "manual_code_not_ready");
  } else if (!outSummary->qrCodeReady) {
    setFixedText(outSummary->phaseName, sizeof(outSummary->phaseName),
                 "onboarding");
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "qr_code_not_ready");
  } else if (!outSummary->threadDatasetExportable) {
    setFixedText(outSummary->phaseName, sizeof(outSummary->phaseName),
                 "dataset");
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "thread_dataset_not_exportable");
  } else {
    setFixedText(outSummary->phaseName, sizeof(outSummary->phaseName), "ready");
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "none");
  }

