lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/matter_onnetwork_onoff_light.cpp
  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::discoverySummary(
    MatterOnNetworkDiscoverySummary* outSummary) const {
  if (outSummary == nullptr) {
    return false;
  }

  *outSummary = MatterOnNetworkDiscoverySummary{};
  outSummary->valid = true;
  outSummary->serviceType = foundation_.commissionableServiceType();
  outSummary->port = Nrf54MatterOnOffLightFoundation::kMatterUdpPort;
  outSummary->discriminator = identity_.discriminator;
  outSummary->vendorId = identity_.vendorId;
  outSummary->productId = identity_.productId;
  outSummary->deviceTypeId =
      Nrf54MatterOnOffLightFoundation::kOnOffLightDeviceTypeId;
  const MatterCommissioningWindowState windowState = commissioningWindowState();
  outSummary->commissioningWindowOpen =
      windowState == MatterCommissioningWindowState::kOpen;
  outSummary->threadAttached = thread_.attached();
  outSummary->commissioningMode =
      (windowState == MatterCommissioningWindowState::kOpen ||
       windowState == MatterCommissioningWindowState::kPendingReadiness)
          ? MatterDiscoveryCommissioningMode::kBasicCommissioning
          : MatterDiscoveryCommissioningMode::kNotCommissioning;
  (void)foundation_.discoveryCapabilities(&outSummary->capabilities);
  outSummary->stagedOnly =
      !outSummary->capabilities.canRegisterCommissionableNode;

  const uint32_t instanceHigh =
      0x4E35344CUL ^ identity_.setupPinCode ^
      (static_cast<uint32_t>(identity_.discriminator) << 16U);
  const uint32_t instanceLow =
      (static_cast<uint32_t>(identity_.vendorId) << 16U) |
      static_cast<uint32_t>(identity_.productId);
  snprintf(outSummary->instanceName, sizeof(outSummary->instanceName),
           "%08lX%08lX", static_cast<unsigned long>(instanceHigh),
           static_cast<unsigned long>(instanceLow));
  setFixedText(outSummary->deviceName, sizeof(outSummary->deviceName),
               "Nrf54L15 Light");
  snprintf(outSummary->txtDiscriminator, sizeof(outSummary->txtDiscriminator),
           "D=%u", static_cast<unsigned>(outSummary->discriminator));
  snprintf(outSummary->txtVendorProduct, sizeof(outSummary->txtVendorProduct),
           "VP=%u+%u", static_cast<unsigned>(outSummary->vendorId),
           static_cast<unsigned>(outSummary->productId));
  snprintf(outSummary->txtCommissioningMode,
           sizeof(outSummary->txtCommissioningMode), "CM=%u",
           static_cast<unsigned>(outSummary->commissioningMode));
  snprintf(outSummary->txtDeviceType, sizeof(outSummary->txtDeviceType),
           "DT=%lu", static_cast<unsigned long>(outSummary->deviceTypeId));
  snprintf(outSummary->txtDeviceName, sizeof(outSummary->txtDeviceName),
           "DN=%s", outSummary->deviceName);

  MatterOnNetworkReadinessSummary readiness = {};
  const bool haveReadiness = readinessSummary(&readiness);
  outSummary->readyToRegister =
      haveReadiness && readiness.ready && outSummary->commissioningWindowOpen &&
      outSummary->threadAttached &&
      outSummary->capabilities.canRegisterCommissionableNode;

  if (windowState == MatterCommissioningWindowState::kPendingReadiness) {
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "commissioning_window_pending_readiness");
  } else if (windowState == MatterCommissioningWindowState::kExpired) {
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "commissioning_window_expired");
  } else if (!outSummary->commissioningWindowOpen) {
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "commissioning_window_closed");
  } else if (!outSummary->threadAttached) {
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "thread_not_attached");
  } else if (!haveReadiness || !readiness.ready) {
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 haveReadiness ? readiness.blockerName : "readiness_unknown");
  } else if (!outSummary->capabilities.canRegisterCommissionableNode) {
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 outSummary->capabilities.blockerName);
  } else {
    setFixedText(outSummary->blockerName, sizeof(outSummary->blockerName),
                 "none");
  }

  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::discoveryPublicationState(
    MatterOnNetworkDiscoveryPublicationState* outState) const {
  if (outState == nullptr) {
    return false;
  }

  *outState = MatterOnNetworkDiscoveryPublicationState{};
  outState->attempted = discoveryPublicationAttempted_;
  outState->active = discoveryPublicationActive_;
  outState->stagedOnly = !discoveryPublicationBackendAvailable_;
  outState->backendAvailable = discoveryPublicationBackendAvailable_;
  MatterFoundationDiscoveryCapabilities capabilities = {};
  (void)foundation_.discoveryCapabilities(&capabilities);
  outState->srpClientEnabled =
      capabilities.srpClientEnabled && capabilities.ecdsaEnabled;
  outState->srpServiceQueued = discoverySrpServiceQueued_;
  outState->srpAutoStartEnabled = discoverySrpAutoStartEnabled_;
  outState->srpRemovePending = discoverySrpRemovePending_;
  outState->srpHostRegistered = discoverySrpHostRegistered_;
  outState->srpServiceRegistered = discoverySrpServiceRegistered_;
  outState->commissioningWindowOpen = commissioningWindowOpen();
  outState->threadAttached = thread_.attached();
  outState->windowState = discoveryPublicationWindowState_;
  outState->recordsTotal = discoveryPublicationRecordsTotal_;
  outState->recordsReady = discoveryPublicationRecordsReady_;
  outState->recordsActive = discoveryPublicationRecordsActive_;
  outState->publishAttempts = discoveryPublicationAttempts_;
  outState->unpublishCount = discoveryPublicationUnpublishCount_;
  outState->srpLastError = discoverySrpLastError_;
  setFixedText(outState->blockerName, sizeof(outState->blockerName),
               discoveryPublicationBlockerName_);
  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::buildCommissionableDiscoveryRecord(
    MatterOnNetworkDiscoveryRecord* outRecord) const {
  if (outRecord == nullptr) {
    return false;
  }

  MatterOnNetworkDiscoverySummary summary = {};
  if (!discoverySummary(&summary)) {
    return false;
  }

