lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/matter_onnetwork_onoff_light.cpp
  *outRecord = MatterOnNetworkDiscoveryRecord{};
  outRecord->valid = summary.valid;
  outRecord->stagedOnly = summary.stagedOnly;
  outRecord->readyToRegister = summary.readyToRegister;
  outRecord->kind = MatterOnNetworkDiscoveryRecordKind::kCommissionable;
  outRecord->serviceType = summary.serviceType;
  outRecord->port = summary.port;
  setFixedText(outRecord->instanceName, sizeof(outRecord->instanceName),
               summary.instanceName);
  buildDiscoveryHostName(identity_, outRecord->hostName,
                         sizeof(outRecord->hostName));
  setFixedText(outRecord->blockerName, sizeof(outRecord->blockerName),
               summary.blockerName);

  char entry[32] = {0};
  snprintf(entry, sizeof(entry), "_S%u",
           static_cast<unsigned>((summary.discriminator >> 8U) & 0x0FU));
  (void)addDiscoverySubtype(outRecord, entry);
  snprintf(entry, sizeof(entry), "_L%u",
           static_cast<unsigned>(summary.discriminator & 0x0FFFU));
  (void)addDiscoverySubtype(outRecord, entry);
  snprintf(entry, sizeof(entry), "_V%u",
           static_cast<unsigned>(summary.vendorId));
  (void)addDiscoverySubtype(outRecord, entry);
  snprintf(entry, sizeof(entry), "_T%lu",
           static_cast<unsigned long>(summary.deviceTypeId));
  (void)addDiscoverySubtype(outRecord, entry);

  (void)addDiscoveryText(outRecord, summary.txtDiscriminator);
  (void)addDiscoveryText(outRecord, summary.txtVendorProduct);
  (void)addDiscoveryText(outRecord, summary.txtCommissioningMode);
  (void)addDiscoveryText(outRecord, summary.txtDeviceType);
  (void)addDiscoveryText(outRecord, summary.txtDeviceName);
  (void)addDiscoveryText(outRecord, "SII=5000");
  (void)addDiscoveryText(outRecord, "SAI=300");
  (void)addDiscoveryText(outRecord, "SAT=4000");
  (void)addDiscoveryText(outRecord, "T=0");
  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::buildOperationalDiscoveryRecord(
    MatterOnNetworkDiscoveryRecord* outRecord) const {
  if (outRecord == nullptr) {
    return false;
  }

  *outRecord = MatterOnNetworkDiscoveryRecord{};
  outRecord->valid = true;
  outRecord->stagedOnly = true;
  outRecord->readyToRegister = false;
  outRecord->kind = MatterOnNetworkDiscoveryRecordKind::kOperational;
  outRecord->serviceType = foundation_.operationalServiceType();
  outRecord->port = Nrf54MatterOnOffLightFoundation::kMatterUdpPort;
  buildDiscoveryHostName(identity_, outRecord->hostName,
                         sizeof(outRecord->hostName));
  snprintf(outRecord->instanceName, sizeof(outRecord->instanceName),
           "UNCOMMISSIONED-%04X",
           static_cast<unsigned>(identity_.discriminator & 0x0FFFU));
  outRecord->instanceName[sizeof(outRecord->instanceName) - 1U] = '\0';

  MatterOnNetworkReadinessSummary readiness = {};
  const bool haveReadiness = readinessSummary(&readiness);
  if (!thread_.attached()) {
    setFixedText(outRecord->blockerName, sizeof(outRecord->blockerName),
                 "thread_not_attached");
  } else if (!haveReadiness || !readiness.ready) {
    setFixedText(outRecord->blockerName, sizeof(outRecord->blockerName),
                 haveReadiness ? readiness.blockerName : "readiness_unknown");
  } else {
    setFixedText(outRecord->blockerName, sizeof(outRecord->blockerName),
                 "operational_fabric_not_commissioned");
  }

  (void)addDiscoveryText(outRecord, "SII=5000");
  (void)addDiscoveryText(outRecord, "SAI=300");
  (void)addDiscoveryText(outRecord, "SAT=4000");
  (void)addDiscoveryText(outRecord, "T=0");
  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::buildDiscoveryRecords(
    MatterOnNetworkDiscoveryRecord* outRecords,
    size_t recordCapacity,
    size_t* outRecordCount) const {
  static constexpr size_t kRequiredRecordCount = 2U;

  if (outRecordCount != nullptr) {
    *outRecordCount = kRequiredRecordCount;
  }
  if (outRecords == nullptr || recordCapacity < kRequiredRecordCount) {
    return false;
  }

  return buildCommissionableDiscoveryRecord(&outRecords[0]) &&
         buildOperationalDiscoveryRecord(&outRecords[1]);
}

#if defined(OPENTHREAD_CONFIG_SRP_CLIENT_ENABLE) && \
    (OPENTHREAD_CONFIG_SRP_CLIENT_ENABLE != 0)
bool Nrf54MatterOnNetworkOnOffLightNode::prepareSrpTxtEntries(
    const MatterOnNetworkDiscoveryRecord& record) {
  memset(srpTxtEntries_, 0, sizeof(srpTxtEntries_));
  memset(srpTxtKeys_, 0, sizeof(srpTxtKeys_));
  memset(srpTxtValues_, 0, sizeof(srpTxtValues_));

  if (record.textEntryCount >
      MatterOnNetworkDiscoveryRecord::kMaxTextEntries) {
    return false;
  }

  for (size_t i = 0; i < record.textEntryCount; ++i) {
    const char* text = record.textEntries[i].value;
    if (text == nullptr || text[0] == '\0') {
      return false;
    }

    const char* separator = strchr(text, '=');
    const size_t keyLength =
        separator != nullptr ? static_cast<size_t>(separator - text)
                             : strlen(text);
    if (keyLength == 0U || keyLength >= sizeof(srpTxtKeys_[i])) {
      return false;
    }

    memcpy(srpTxtKeys_[i], text, keyLength);
    srpTxtKeys_[i][keyLength] = '\0';
    srpTxtEntries_[i].mKey = srpTxtKeys_[i];

    if (separator != nullptr) {
      const char* value = separator + 1;
      if (strlen(value) >= sizeof(srpTxtValues_[i])) {
        return false;
      }
      setFixedText(srpTxtValues_[i], sizeof(srpTxtValues_[i]), value);
      srpTxtEntries_[i].mValue =
          reinterpret_cast<const uint8_t*>(srpTxtValues_[i]);
      srpTxtEntries_[i].mValueLength =
          static_cast<uint16_t>(strlen(srpTxtValues_[i]));
    }
  }

  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::prepareSrpSubtypes(
    const MatterOnNetworkDiscoveryRecord& record) {
  memset(srpSubtypePointers_, 0, sizeof(srpSubtypePointers_));
  memset(srpSubtypeLabels_, 0, sizeof(srpSubtypeLabels_));

  if (record.subtypeCount >
      MatterOnNetworkDiscoveryRecord::kMaxSubtypes) {
    return false;
  }

  for (size_t i = 0; i < record.subtypeCount; ++i) {
    const char* subtype = record.subtypes[i].value;
    if (subtype == nullptr || subtype[0] == '\0' ||
        strlen(subtype) >= sizeof(srpSubtypeLabels_[i])) {
      return false;
    }
    setFixedText(srpSubtypeLabels_[i], sizeof(srpSubtypeLabels_[i]), subtype);
    srpSubtypePointers_[i] = srpSubtypeLabels_[i];
  }

