lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/matter_onnetwork_onoff_light.cpp
  srpSubtypePointers_[record.subtypeCount] = nullptr;
  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::publishCommissionableDiscoveryRecord(
    const MatterOnNetworkDiscoveryRecord& record) {
  if (!record.valid || !record.readyToRegister ||
      record.serviceType == nullptr || record.port == 0U) {
    discoverySrpLastError_ = static_cast<int>(OT_ERROR_INVALID_ARGS);
    return false;
  }

  otInstance* instance = thread_.rawInstance();
  if (instance == nullptr) {
    discoverySrpLastError_ = static_cast<int>(OT_ERROR_INVALID_STATE);
    return false;
  }

  if (discoverySrpRemovePending_) {
    discoverySrpLastError_ = static_cast<int>(OT_ERROR_BUSY);
    return false;
  }

  if (discoverySrpServiceQueued_) {
    return true;
  }

  if (strlen(record.hostName) >= sizeof(srpHostName_) ||
      strlen(record.instanceName) >= sizeof(srpInstanceName_) ||
      !prepareSrpTxtEntries(record) || !prepareSrpSubtypes(record)) {
    discoverySrpLastError_ = static_cast<int>(OT_ERROR_INVALID_ARGS);
    return false;
  }

  otSrpClientClearHostAndServices(instance);
  memset(&srpCommissionableService_, 0, sizeof(srpCommissionableService_));
  setFixedText(srpHostName_, sizeof(srpHostName_), record.hostName);
  setFixedText(srpInstanceName_, sizeof(srpInstanceName_), record.instanceName);

  otSrpClientSetCallback(instance, onSrpClientCallback, this);
  otSrpClientEnableAutoStartMode(instance, onSrpAutoStart, this);

  otError error = otSrpClientSetHostName(instance, srpHostName_);
  if (error != OT_ERROR_NONE) {
    discoverySrpLastError_ = static_cast<int>(error);
    return false;
  }

  error = otSrpClientEnableAutoHostAddress(instance);
  if (error != OT_ERROR_NONE) {
    discoverySrpLastError_ = static_cast<int>(error);
    return false;
  }

  srpCommissionableService_.mName = record.serviceType;
  srpCommissionableService_.mInstanceName = srpInstanceName_;
  srpCommissionableService_.mSubTypeLabels =
      record.subtypeCount > 0U ? srpSubtypePointers_ : nullptr;
  srpCommissionableService_.mTxtEntries = srpTxtEntries_;
  srpCommissionableService_.mPort = record.port;
  srpCommissionableService_.mPriority = 0U;
  srpCommissionableService_.mWeight = 0U;
  srpCommissionableService_.mNumTxtEntries =
      static_cast<uint8_t>(record.textEntryCount);
  srpCommissionableService_.mLease = 0U;
  srpCommissionableService_.mKeyLease = 0U;

  error = otSrpClientAddService(instance, &srpCommissionableService_);
  discoverySrpLastError_ = static_cast<int>(error);
  if (error == OT_ERROR_NONE || error == OT_ERROR_ALREADY) {
    discoverySrpServiceQueued_ = true;
    discoverySrpRemovePending_ = false;
    return true;
  }

  return false;
}

void Nrf54MatterOnNetworkOnOffLightNode::resetSrpDiscoveryBuffers() {
  discoverySrpServiceQueued_ = false;
  discoverySrpAutoStartEnabled_ = false;
  discoverySrpRemovePending_ = false;
  discoverySrpHostRegistered_ = false;
  discoverySrpServiceRegistered_ = false;
  memset(&srpCommissionableService_, 0, sizeof(srpCommissionableService_));
  memset(srpHostName_, 0, sizeof(srpHostName_));
  memset(srpInstanceName_, 0, sizeof(srpInstanceName_));
  memset(srpTxtEntries_, 0, sizeof(srpTxtEntries_));
  memset(srpTxtKeys_, 0, sizeof(srpTxtKeys_));
  memset(srpTxtValues_, 0, sizeof(srpTxtValues_));
  memset(srpSubtypePointers_, 0, sizeof(srpSubtypePointers_));
  memset(srpSubtypeLabels_, 0, sizeof(srpSubtypeLabels_));
}

bool Nrf54MatterOnNetworkOnOffLightNode::requestSrpDiscoveryUnpublish(
    bool sendUnregisterToServer) {
  otInstance* instance = thread_.rawInstance();
  if (instance == nullptr) {
    resetSrpDiscoveryBuffers();
    discoverySrpLastError_ = static_cast<int>(OT_ERROR_INVALID_STATE);
    return false;
  }

  if (discoverySrpRemovePending_) {
    return true;
  }

  const bool haveSrpState =
      discoverySrpServiceQueued_ || discoverySrpHostRegistered_ ||
      discoverySrpServiceRegistered_;
  if (!haveSrpState) {
    otSrpClientClearHostAndServices(instance);
    resetSrpDiscoveryBuffers();
    discoverySrpLastError_ = 0;
    return true;
  }

  const otError error =
      otSrpClientRemoveHostAndServices(instance, false, sendUnregisterToServer);
  discoverySrpLastError_ = static_cast<int>(error);
  if (error == OT_ERROR_NONE) {
    discoverySrpServiceQueued_ = false;
    discoverySrpRemovePending_ = true;
    return true;
  }
  if (error == OT_ERROR_ALREADY) {
    otSrpClientClearHostAndServices(instance);
    resetSrpDiscoveryBuffers();
    return true;
  }

  return false;
}

void Nrf54MatterOnNetworkOnOffLightNode::clearSrpDiscoveryPublication() {
  (void)requestSrpDiscoveryUnpublish(false);
}

void Nrf54MatterOnNetworkOnOffLightNode::onSrpClientCallback(
    otError error,
    const otSrpClientHostInfo* hostInfo,
    const otSrpClientService* services,
    const otSrpClientService* removedServices,
    void* context) {
  (void)hostInfo;
  (void)services;
  (void)removedServices;
  Nrf54MatterOnNetworkOnOffLightNode* self =
      static_cast<Nrf54MatterOnNetworkOnOffLightNode*>(context);
  if (self == nullptr) {
    return;
  }

  self->discoverySrpLastError_ = static_cast<int>(error);

  if (hostInfo != nullptr) {
    self->discoverySrpHostRegistered_ =
        hostInfo->mState == OT_SRP_CLIENT_ITEM_STATE_REGISTERED;
  }

  bool serviceRegistered = false;
  for (const otSrpClientService* service = services; service != nullptr;
       service = service->mNext) {
    if (service == &self->srpCommissionableService_ &&
        service->mState == OT_SRP_CLIENT_ITEM_STATE_REGISTERED) {
      serviceRegistered = true;
      break;
    }
  }
  self->discoverySrpServiceRegistered_ = serviceRegistered;

  bool serviceRemoved = false;
  for (const otSrpClientService* service = removedServices; service != nullptr;
       service = service->mNext) {
    if (service == &self->srpCommissionableService_) {
      serviceRemoved = true;
      break;
    }
  }

  if (self->discoverySrpRemovePending_ && error == OT_ERROR_NONE &&
      (serviceRemoved || services == nullptr)) {
    self->resetSrpDiscoveryBuffers();
  }
}

