lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/matter_onnetwork_onoff_light.cpp
void Nrf54MatterOnNetworkOnOffLightNode::onSrpAutoStart(
    const otSockAddr* serverSockAddr,
    void* context) {
  Nrf54MatterOnNetworkOnOffLightNode* self =
      static_cast<Nrf54MatterOnNetworkOnOffLightNode*>(context);
  if (self == nullptr) {
    return;
  }

  self->discoverySrpAutoStartEnabled_ = serverSockAddr != nullptr;
}
#else
bool Nrf54MatterOnNetworkOnOffLightNode::publishCommissionableDiscoveryRecord(
    const MatterOnNetworkDiscoveryRecord& record) {
  (void)record;
  return false;
}

void Nrf54MatterOnNetworkOnOffLightNode::clearSrpDiscoveryPublication() {
  resetSrpDiscoveryBuffers();
}

bool Nrf54MatterOnNetworkOnOffLightNode::requestSrpDiscoveryUnpublish(
    bool sendUnregisterToServer) {
  (void)sendUnregisterToServer;
  resetSrpDiscoveryBuffers();
  return true;
}

void Nrf54MatterOnNetworkOnOffLightNode::resetSrpDiscoveryBuffers() {
  discoverySrpServiceQueued_ = false;
  discoverySrpAutoStartEnabled_ = false;
  discoverySrpRemovePending_ = false;
  discoverySrpHostRegistered_ = false;
  discoverySrpServiceRegistered_ = false;
  discoverySrpLastError_ = 0;
}
#endif

bool Nrf54MatterOnNetworkOnOffLightNode::updateDiscoveryPublication() {
  MatterOnNetworkDiscoveryRecord records[2] = {};
  size_t recordCount = 0U;
  const bool recordsOk =
      buildDiscoveryRecords(records, sizeof(records) / sizeof(records[0]),
                            &recordCount);
  const MatterCommissioningWindowState windowState = commissioningWindowState();
  const bool windowOpen = (windowState == MatterCommissioningWindowState::kOpen);
  bool backendAvailable = false;
  uint16_t recordsReady = 0U;
  const char* blocker = "none";
  bool blockerCaptured = false;

  if (recordsOk) {
    for (size_t i = 0; i < recordCount; ++i) {
      if (records[i].readyToRegister) {
        ++recordsReady;
      } else if (!blockerCaptured && records[i].blockerName[0] != '\0') {
        blocker = records[i].blockerName;
        blockerCaptured = true;
      }
    }
  } else {
    blocker = "discovery_record_build_failed";
  }

  MatterOnNetworkDiscoverySummary summary = {};
  bool srpBackendAvailable = false;
  if (discoverySummary(&summary)) {
    backendAvailable = summary.capabilities.canRegisterCommissionableNode;
    srpBackendAvailable =
        summary.capabilities.srpClientEnabled && summary.capabilities.ecdsaEnabled;
    if (!backendAvailable && windowOpen) {
      blocker = summary.capabilities.blockerName != nullptr
                    ? summary.capabilities.blockerName
                    : "discovery_backend_unavailable";
    }
  }

  if (!windowOpen) {
    if (discoveryPublicationActive_ || discoverySrpServiceQueued_ ||
        discoverySrpHostRegistered_ || discoverySrpServiceRegistered_ ||
        discoverySrpRemovePending_) {
      ++discoveryPublicationUnpublishCount_;
    }
    (void)requestSrpDiscoveryUnpublish(true);
    discoveryPublicationActive_ = false;
    discoveryPublicationRecordsActive_ = 0U;
    discoveryPublicationWindowState_ = windowState;
    discoveryPublicationBackendAvailable_ = backendAvailable;
    discoveryPublicationRecordsTotal_ =
        recordsOk ? static_cast<uint16_t>(recordCount) : 0U;
    discoveryPublicationRecordsReady_ = recordsReady;
    if (discoverySrpRemovePending_) {
      blocker = "srp_unpublish_pending";
    } else if (windowState == MatterCommissioningWindowState::kPendingReadiness) {
      blocker = "commissioning_window_pending_readiness";
    } else if (windowState == MatterCommissioningWindowState::kExpired) {
      blocker = "commissioning_window_expired";
    } else {
      blocker = "commissioning_window_closed";
    }
    setFixedText(discoveryPublicationBlockerName_,
                 sizeof(discoveryPublicationBlockerName_), blocker);
    return false;
  }

  bool active = false;
  if (recordsOk && backendAvailable && recordsReady > 0U) {
    if (srpBackendAvailable) {
      active = publishCommissionableDiscoveryRecord(records[0]);
      if (!active) {
        blocker = "srp_publish_failed";
      }
    } else {
      (void)requestSrpDiscoveryUnpublish(false);
      blocker = "platform_dnssd_adapter_missing";
    }
  } else {
    (void)requestSrpDiscoveryUnpublish(false);
    if (discoverySrpRemovePending_) {
      blocker = "srp_unpublish_pending";
    }
  }

  const bool changed =
      discoveryPublicationWindowState_ != windowState ||
      discoveryPublicationBackendAvailable_ != backendAvailable ||
      discoveryPublicationRecordsTotal_ != static_cast<uint16_t>(recordCount) ||
      discoveryPublicationRecordsReady_ != recordsReady ||
      discoveryPublicationActive_ != active ||
      strcmp(discoveryPublicationBlockerName_, blocker) != 0;
  if (changed) {
    ++discoveryPublicationAttempts_;
  }

  discoveryPublicationAttempted_ = true;
  discoveryPublicationActive_ = active;
  discoveryPublicationBackendAvailable_ = backendAvailable;
  discoveryPublicationWindowState_ = windowState;
  discoveryPublicationRecordsTotal_ =
      recordsOk ? static_cast<uint16_t>(recordCount) : 0U;
  discoveryPublicationRecordsReady_ = recordsReady;
  discoveryPublicationRecordsActive_ = active ? recordsReady : 0U;
  setFixedText(discoveryPublicationBlockerName_,
               sizeof(discoveryPublicationBlockerName_),
               active ? "srp_publication_queued" : blocker);
  return active;
}

void Nrf54MatterOnNetworkOnOffLightNode::resetDiscoveryPublication(
    const char* blockerName) {
  discoveryPublicationAttempted_ = false;
  discoveryPublicationActive_ = false;
  discoveryPublicationBackendAvailable_ = false;
  resetSrpDiscoveryBuffers();
  discoveryPublicationRecordsTotal_ = 0U;
  discoveryPublicationRecordsReady_ = 0U;
  discoveryPublicationRecordsActive_ = 0U;
  discoveryPublicationAttempts_ = 0U;
  discoveryPublicationUnpublishCount_ = 0U;
  discoveryPublicationWindowState_ = MatterCommissioningWindowState::kClosed;
  setFixedText(discoveryPublicationBlockerName_,
               sizeof(discoveryPublicationBlockerName_),
               blockerName != nullptr ? blockerName : "not_started");
}

