lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/matter_onnetwork_onoff_light.cpp
bool Nrf54MatterOnNetworkOnOffLightNode::buildCommissioningBundle(
    MatterOnNetworkCommissioningBundle* outBundle) const {
  if (outBundle == nullptr) {
    return false;
  }

  *outBundle = MatterOnNetworkCommissioningBundle{};
  outBundle->datasetSource = datasetSource_;
  outBundle->commissioningWindowState = commissioningWindowState();
  outBundle->commissioningWindowSecondsRemaining =
      commissioningWindowSecondsRemaining();
  outBundle->manualCodeReady =
      manualPairingCode(outBundle->manualCode, sizeof(outBundle->manualCode));
  outBundle->qrCodeReady =
      qrCode(outBundle->qrCode, sizeof(outBundle->qrCode));
  outBundle->openThreadDatasetReady = exportOpenThreadDatasetHex(
      outBundle->openThreadDatasetHex, sizeof(outBundle->openThreadDatasetHex),
      &outBundle->openThreadDatasetHexLength);
#if defined(NRF54L15_CLEAN_MATTER_CORE_ENABLE) && \
    (NRF54L15_CLEAN_MATTER_CORE_ENABLE != 0)
  outBundle->matterThreadDatasetReady = exportMatterThreadDatasetHex(
      outBundle->matterThreadDatasetHex,
      sizeof(outBundle->matterThreadDatasetHex),
      &outBundle->matterThreadDatasetHexLength, nullptr);
#endif
  outBundle->ready = readyForOnNetworkCommissioning();
  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::exportOpenThreadDatasetTlvs(
    otOperationalDatasetTlvs* outTlvs) const {
  if (outTlvs == nullptr) {
    return false;
  }

  memset(outTlvs, 0, sizeof(*outTlvs));
  otOperationalDataset dataset = {};
  if (!thread_.getConfiguredOrActiveDataset(&dataset)) {
    return false;
  }

  otDatasetConvertToTlvs(&dataset, outTlvs);
  return otDatasetIsValid(outTlvs, true);
}

bool Nrf54MatterOnNetworkOnOffLightNode::exportOpenThreadDatasetHex(
    char* outBuffer, size_t outBufferSize, size_t* outHexLength) const {
  otOperationalDatasetTlvs datasetTlvs = {};
  if (!exportOpenThreadDatasetTlvs(&datasetTlvs)) {
    if (outHexLength != nullptr) {
      *outHexLength = 0U;
    }
    return false;
  }
  return bytesToUpperHex(datasetTlvs.mTlvs, datasetTlvs.mLength, outBuffer,
                         outBufferSize, outHexLength);
}

bool Nrf54MatterOnNetworkOnOffLightNode::manualPairingCode(
    char* outBuffer, size_t outBufferSize) const {
  MatterManualPairingPayload payload = {};
  buildManualPayload(&payload);
  if (outBuffer == nullptr || outBufferSize == 0U) {
    return matterManualPairingPayloadValid(payload);
  }
  return matterManualPairingCode(payload, outBuffer, outBufferSize);
}

bool Nrf54MatterOnNetworkOnOffLightNode::qrCode(char* outBuffer,
                                                size_t outBufferSize) const {
  MatterQrCodePayload payload = {};
  buildQrPayload(&payload);
  if (outBuffer == nullptr || outBufferSize == 0U) {
    return matterQrCodePayloadValid(payload);
  }
  return matterQrCode(payload, outBuffer, outBufferSize);
}

bool Nrf54MatterOnNetworkOnOffLightNode::readyForOnNetworkCommissioning()
    const {
  MatterOnNetworkReadinessSummary summary = {};
  return readinessSummary(&summary) && summary.ready;
}

#if defined(NRF54L15_CLEAN_MATTER_CORE_ENABLE) && \
    (NRF54L15_CLEAN_MATTER_CORE_ENABLE != 0)
bool Nrf54MatterOnNetworkOnOffLightNode::exportThreadDataset(
    chip::Thread::OperationalDataset* outDataset, CHIP_ERROR* outError) const {
  otOperationalDataset threadDataset = {};
  if (!thread_.getConfiguredOrActiveDataset(&threadDataset)) {
    if (outError != nullptr) {
      *outError = CHIP_ERROR_INCORRECT_STATE;
    }
    return false;
  }
  return foundation_.exportThreadDataset(threadDataset, outDataset, outError);
}

bool Nrf54MatterOnNetworkOnOffLightNode::exportMatterThreadDatasetHex(
    char* outBuffer, size_t outBufferSize, size_t* outHexLength,
    CHIP_ERROR* outError) const {
  chip::Thread::OperationalDataset dataset;
  CHIP_ERROR error = CHIP_NO_ERROR;
  if (!exportThreadDataset(&dataset, &error)) {
    if (outHexLength != nullptr) {
      *outHexLength = 0U;
    }
    if (outError != nullptr) {
      *outError = error;
    }
    return false;
  }

  const chip::ByteSpan span = dataset.AsByteSpan();
  if (outBuffer == nullptr || outBufferSize < ((span.size() * 2U) + 1U)) {
    if (outHexLength != nullptr) {
      *outHexLength = 0U;
    }
    if (outError != nullptr) {
      *outError = CHIP_ERROR_BUFFER_TOO_SMALL;
    }
    return false;
  }

  error = chip::Encoding::BytesToUppercaseHexString(
      span.data(), span.size(), outBuffer, outBufferSize);
  if (outHexLength != nullptr) {
    *outHexLength = (error == CHIP_NO_ERROR) ? (span.size() * 2U) : 0U;
  }
  if (outError != nullptr) {
    *outError = error;
  }
  return error == CHIP_NO_ERROR;
}
#endif

Nrf54MatterOnOffLightDevice& Nrf54MatterOnNetworkOnOffLightNode::light() {
  return light_;
}

const Nrf54MatterOnOffLightDevice&
Nrf54MatterOnNetworkOnOffLightNode::light() const {
  return light_;
}

Nrf54MatterOnOffLightEndpoint& Nrf54MatterOnNetworkOnOffLightNode::endpoint() {
  return endpoint_;
}

const Nrf54MatterOnOffLightEndpoint&
Nrf54MatterOnNetworkOnOffLightNode::endpoint() const {
  return endpoint_;
}

const Nrf54MatterOnOffLightFoundation&
Nrf54MatterOnNetworkOnOffLightNode::foundation() const {
  return foundation_;
}

Nrf54ThreadExperimental& Nrf54MatterOnNetworkOnOffLightNode::thread() {
  return thread_;
}

const Nrf54ThreadExperimental& Nrf54MatterOnNetworkOnOffLightNode::thread()
    const {
  return thread_;
}

void Nrf54MatterOnNetworkOnOffLightNode::buildDefaultIdentity(
    MatterOnNetworkIdentity* outIdentity) {
  if (outIdentity == nullptr) {
    return;
  }

  outIdentity->setupPinCode = kDefaultSetupPinCode;
  outIdentity->discriminator = kDefaultDiscriminator;
  const uint64_t deviceId = Ficr::deviceId();
  if (factoryDeviceIdUsable(deviceId)) {
    outIdentity->discriminator = discriminatorFromDeviceId(deviceId);
  }
  outIdentity->vendorId = kDefaultVendorId;
  outIdentity->productId = kDefaultProductId;
  outIdentity->commissioningFlow = MatterCommissioningFlow::kStandard;
}

bool Nrf54MatterOnNetworkOnOffLightNode::identityValid(
    const MatterOnNetworkIdentity& identity) {
  return matterSetupPinValid(identity.setupPinCode) &&
         matterDiscriminatorValid(identity.discriminator) &&
         commissioningFlowValid(identity.commissioningFlow);
}

const char* Nrf54MatterOnNetworkOnOffLightNode::datasetSourceName(
    MatterOnNetworkDatasetSource source) {
  switch (source) {
    case MatterOnNetworkDatasetSource::kNone:
      return "none";
    case MatterOnNetworkDatasetSource::kDemo:
      return "demo";
    case MatterOnNetworkDatasetSource::kPassphrase:
      return "passphrase";
    case MatterOnNetworkDatasetSource::kExplicit:
      return "explicit";
    case MatterOnNetworkDatasetSource::kPersistent:
      return "persistent";
    default:
      return "unknown";
  }
}

const char* Nrf54MatterOnNetworkOnOffLightNode::commissioningWindowStateName(
    MatterCommissioningWindowState state) {
  switch (state) {
    case MatterCommissioningWindowState::kClosed:
      return "closed";
    case MatterCommissioningWindowState::kPendingReadiness:
      return "pending-readiness";
    case MatterCommissioningWindowState::kOpen:
      return "open";
    case MatterCommissioningWindowState::kExpired:
      return "expired";
    default:
      return "unknown";
  }
}

const char* Nrf54MatterOnNetworkOnOffLightNode::discoveryRecordKindName(
    MatterOnNetworkDiscoveryRecordKind kind) {
  switch (kind) {
    case MatterOnNetworkDiscoveryRecordKind::kCommissionable:
      return "commissionable";
    case MatterOnNetworkDiscoveryRecordKind::kOperational:
      return "operational";
    default:
      return "unknown";
  }
}

bool Nrf54MatterOnNetworkOnOffLightNode::loadPersistentIdentity(
    MatterOnNetworkIdentity* outIdentity) const {
  if (!storageOpen_ || outIdentity == nullptr ||
      prefs_.getBytesLength(kPersistentStateKey) !=
          sizeof(MatterOnNetworkPersistentState)) {
    return false;
  }

  MatterOnNetworkPersistentState state = {};
  if (prefs_.getBytes(kPersistentStateKey, &state, sizeof(state)) !=
      sizeof(state) ||
      state.magic != kPersistentStateMagic ||
      state.version != kPersistentStateVersion) {
    return false;
  }

