lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/matter_onnetwork_onoff_light.cpp
  MatterOnNetworkIdentity candidate = {};
  candidate.setupPinCode = state.setupPinCode;
  candidate.discriminator = state.discriminator;
  candidate.vendorId = state.vendorId;
  candidate.productId = state.productId;
  candidate.commissioningFlow =
      static_cast<MatterCommissioningFlow>(state.commissioningFlow);
  if (!identityValid(candidate)) {
    return false;
  }

  *outIdentity = candidate;
  return true;
}

bool Nrf54MatterOnNetworkOnOffLightNode::loadPersistentThreadDataset(
    otOperationalDatasetTlvs* outTlvs) const {
  if (!storageOpen_ || outTlvs == nullptr ||
      prefs_.getBytesLength(kPersistentThreadDatasetKey) !=
          sizeof(MatterOnNetworkPersistentThreadDataset)) {
    return false;
  }

  MatterOnNetworkPersistentThreadDataset state = {};
  if (prefs_.getBytes(kPersistentThreadDatasetKey, &state, sizeof(state)) !=
          sizeof(state) ||
      state.magic != kPersistentThreadDatasetMagic ||
      state.version != kPersistentThreadDatasetVersion ||
      state.length == 0U || state.length > OT_OPERATIONAL_DATASET_MAX_LENGTH) {
    return false;
  }

  memset(outTlvs, 0, sizeof(*outTlvs));
  outTlvs->mLength = state.length;
  memcpy(outTlvs->mTlvs, state.tlvs, state.length);
  return otDatasetIsValid(outTlvs, true);
}

void Nrf54MatterOnNetworkOnOffLightNode::buildManualPayload(
    MatterManualPairingPayload* outPayload) const {
  if (outPayload == nullptr) {
    return;
  }

  *outPayload = MatterManualPairingPayload{};
  outPayload->setupPinCode = identity_.setupPinCode;
  outPayload->discriminator = identity_.discriminator;
  outPayload->vendorId = identity_.vendorId;
  outPayload->productId = identity_.productId;
  outPayload->commissioningFlow = identity_.commissioningFlow;
}

void Nrf54MatterOnNetworkOnOffLightNode::buildQrPayload(
    MatterQrCodePayload* outPayload) const {
  if (outPayload == nullptr) {
    return;
  }

  *outPayload = MatterQrCodePayload{};
  outPayload->setupPinCode = identity_.setupPinCode;
  outPayload->discriminator = identity_.discriminator;
  outPayload->vendorId = identity_.vendorId;
  outPayload->productId = identity_.productId;
  outPayload->rendezvousFlags =
      kMatterRendezvousOnNetwork | kMatterRendezvousThread;
  outPayload->commissioningFlow = identity_.commissioningFlow;
}

bool Nrf54MatterOnNetworkOnOffLightNode::threadDatasetExportable() const {
  otOperationalDataset dataset = {};
  if (!thread_.getConfiguredOrActiveDataset(&dataset)) {
    return false;
  }

#if defined(NRF54L15_CLEAN_MATTER_CORE_ENABLE) && \
    (NRF54L15_CLEAN_MATTER_CORE_ENABLE != 0)
  chip::Thread::OperationalDataset matterDataset;
  CHIP_ERROR error = CHIP_NO_ERROR;
  return foundation_.exportThreadDataset(dataset, &matterDataset, &error);
#else
  otOperationalDatasetTlvs datasetTlvs = {};
  otDatasetConvertToTlvs(&dataset, &datasetTlvs);
  return otDatasetIsValid(&datasetTlvs, true);
#endif
}

}  // namespace xiao_nrf54l15
#endif // NRF54L15_CLEAN_MATTER_CORE_ENABLE
